tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2331_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F2331_H_
#define _PIC18F2331_H_

#define DFLTCON                       0
#define FLTCK0                        1
#define FLTCK                         2
#define FLTCK1                        3
#define FLTCK2                        4
#define FLT1EN                        5
#define FLT2EN                        6
#define FLT3EN                        7
#define FLT4EN                        8
#define CAP3CON                       9
#define CAP3M                         10
#define CAP3M0                        11
#define CAP3M1                        12
#define CAP3M2                        13
#define CAP3M3                        14
#define CAP3TMR                       15
#define CAP3REN                       16
#define CAP2CON                       17
#define CAP2M0                        18
#define CAP2M                         19
#define CAP2M1                        20
#define CAP2M2                        21
#define CAP2M3                        22
#define CAP2TMR                       23
#define CAP2REN                       24
#define CAP1CON                       25
#define CAP1M                         26
#define CAP1M0                        27
#define CAP1M1                        28
#define CAP1M2                        29
#define CAP1M3                        30
#define CAP1TMR                       31
#define CAP1REN                       32
#define OVDCONS                       33
#define POUT                          34
#define POUT0                         35
#define POUT1                         36
#define POUT2                         37
#define POUT3                         38
#define POUT4                         39
#define POUT5                         40
#define POUT6                         41
#define POUT7                         42
#define OVDCOND                       43
#define POVD                          44
#define POVD0                         45
#define POVD1                         46
#define POVD2                         47
#define POVD3                         48
#define POVD4                         49
#define POVD5                         50
#define POVD6                         51
#define POVD7                         52
#define FLTCONFIG                     53
#define FLTAEN                        54
#define FLTAMOD                       55
#define FLTAS                         56
#define FLTCON                        57
#define FLTBEN                        58
#define FLTBMOD                       59
#define FLTBS                         60
#define BRFEN                         61
#define DTCON                         62
#define DTA                           63
#define DTA0                          64
#define DT0                           65
#define DTA1                          66
#define DT1                           67
#define DTA2                          68
#define DT2                           69
#define DTA3                          70
#define DT3                           71
#define DTA4                          72
#define DT4                           73
#define DTA5                          74
#define DT5                           75
#define DTAPS0                        76
#define DTPS0                         77
#define DTAPS                         78
#define DTAPS1                        79
#define DTPS1                         80
#define PWMCON1                       81
#define OSYNC                         82
#define UDIS                          83
#define SEVTDIR                       84
#define SEVOPS0                       85
#define SEVOPS                        86
#define SEVOPS1                       87
#define SEVOPS2                       88
#define SEVOPS3                       89
#define PWMCON0                       90
#define PMOD                          91
#define PMOD0                         92
#define PMOD1                         93
#define PMOD2                         94
#define PMOD3                         95
#define PWMEN                         96
#define PWMEN0                        97
#define PWMEN1                        98
#define PWMEN2                        99
#define PTCON1                        100
#define PTDIR                         101
#define PTEN                          102
#define PTCON0                        103
#define PTMOD                         104
#define PTMOD0                        105
#define PTMOD1                        106
#define PTCKPS0                       107
#define PTCKPS                        108
#define PTCKPS1                       109
#define PTOPS                         110
#define PTOPS0                        111
#define PTOPS1                        112
#define PTOPS2                        113
#define PTOPS3                        114
#define PORTA                         115
#define AN0                           116
#define ULPWUIN                       117
#define PORTA_RA0                     118
#define AN1                           119
#define PORTA_RA1                     120
#define AN2                           121
#define PORTA_RA2                     122
#define VREFM                         123
#define AN3                           124
#define PORTA_RA3                     125
#define VREFP                         126
#define PORTA_RA4                     127
#define AN4                           128
#define CLKO                          129
#define PORTA_RA6                     130
#define OSC2                          131
#define CLKI                          132
#define PORTA_RA7                     133
#define OSC1                          134
#define RJPU                          135
#define PORTB                         136
#define PORTB_RB0                     137
#define PORTB_RB1                     138
#define PORTB_RB2                     139
#define CCP2_PA2                      140
#define PORTB_RB3                     141
#define PORTB_RB4                     142
#define PORTB_RB5                     143
#define PORTB_RB6                     144
#define PORTB_RB7                     145
#define PORTC                         146
#define T13CKI                        147
#define T1OSO                         148
#define PORTC_RC0                     149
#define nFLTA                         150
#define NOT_FLTA                      151
#define FLTA                          152
#define CCP2                          153
#define T1OSI                         154
#define PA2                           155
#define PORTC_RC1                     156
#define nFLTB                         157
#define FLTB                          158
#define NOT_FLTB                      159
#define CCP1                          160
#define PA1                           161
#define PORTC_RC2                     162
#define INT0                          163
#define T0CKI                         164
#define T5CKI                         165
#define PORTC_RC3                     166
#define INT1                          167
#define SDA                           168
#define SDI                           169
#define PORTC_RC4                     170
#define SCL                           171
#define SCK                           172
#define INT2                          173
#define PORTC_RC5                     174
#define CK                            175
#define PORTC_RC6                     176
#define nSS                           177
#define NOT_SS                        178
#define TX                            179
#define SS                            180
#define DT                            181
#define RX                            182
#define SDO                           183
#define PORTC_RC7                     184
#define PORTE                         185
#define RE3                           186
#define NOT_MCLR                      187
#define MCLR                          188
#define CCP9E                         189
#define nMCLR                         190
#define PC3E                          191
#define LATA                          192
#define LATA0                         193
#define LA0                           194
#define LATA1                         195
#define LA1                           196
#define LATA2                         197
#define LA2                           198
#define LATA3                         199
#define LA3                           200
#define LATA4                         201
#define LA4                           202
#define LATA6                         203
#define LA6                           204
#define LATA7                         205
#define LA7                           206
#define LATB                          207
#define LB0                           208
#define LATB0                         209
#define LB1                           210
#define LATB1                         211
#define LB2                           212
#define LATB2                         213
#define LB3                           214
#define LATB3                         215
#define LB4                           216
#define LATB4                         217
#define LB5                           218
#define LATB5                         219
#define LB6                           220
#define LATB6                         221
#define LB7                           222
#define LATB7                         223
#define LATC                          224
#define LATC0                         225
#define LC0                           226
#define LATC1                         227
#define LC1                           228
#define LATC2                         229
#define LC2                           230
#define LATC3                         231
#define LC3                           232
#define LATC4                         233
#define LC4                           234
#define LATC5                         235
#define LC5                           236
#define LATC6                         237
#define LC6                           238
#define LATC7                         239
#define LC7                           240
#define TRISA                         241
#define TRISA0                        242
#define TRISA_RA0                     243
#define TRISA_RA1                     244
#define TRISA1                        245
#define TRISA_RA2                     246
#define TRISA2                        247
#define TRISA_RA3                     248
#define TRISA3                        249
#define TRISA_RA4                     250
#define TRISA4                        251
#define TRISA_RA6                     252
#define TRISA6                        253
#define TRISA_RA7                     254
#define TRISA7                        255
#define TRISB                         256
#define TRISB_RB0                     257
#define TRISB0                        258
#define TRISB_RB1                     259
#define TRISB1                        260
#define TRISB_RB2                     261
#define TRISB2                        262
#define TRISB_RB3                     263
#define TRISB3                        264
#define TRISB_RB4                     265
#define TRISB4                        266
#define TRISB_RB5                     267
#define TRISB5                        268
#define TRISB_RB6                     269
#define TRISB6                        270
#define TRISB_RB7                     271
#define TRISB7                        272
#define TRISC                         273
#define TRISC0                        274
#define TRISC_RC0                     275
#define TRISC1                        276
#define TRISC_RC1                     277
#define TRISC2                        278
#define TRISC_RC2                     279
#define TRISC3                        280
#define TRISC_RC3                     281
#define TRISC4                        282
#define TRISC_RC4                     283
#define TRISC5                        284
#define TRISC_RC5                     285
#define TRISC6                        286
#define TRISC_RC6                     287
#define TRISC7                        288
#define TRISC_RC7                     289
#define ADCHS                         290
#define SASEL0                        291
#define GASEL0                        292
#define SASEL                         293
#define SASEL1                        294
#define GASEL1                        295
#define SCSEL0                        296
#define GCSEL0                        297
#define SCSEL                         298
#define SCSEL1                        299
#define GCSEL1                        300
#define SBSEL                         301
#define GBSEL0                        302
#define SBSEL0                        303
#define GBSEL1                        304
#define SBSEL1                        305
#define SDSEL                         306
#define SDSEL0                        307
#define GDSEL0                        308
#define SDSEL1                        309
#define GDSEL1                        310
#define ADCON3                        311
#define SSRC0                         312
#define SSRC                          313
#define SSRC1                         314
#define SSRC2                         315
#define SSRC3                         316
#define SSRC4                         317
#define ADRS                          318
#define ADRS0                         319
#define ADRS1                         320
#define OSCTUNE                       321
#define TUN0                          322
#define TUN                           323
#define TUN1                          324
#define TUN2                          325
#define TUN3                          326
#define TUN4                          327
#define TUN5                          328
#define PIE1                          329
#define TMR1IE                        330
#define TMR2IE                        331
#define CCP1IE                        332
#define SSPIE                         333
#define TXIE                          334
#define TBIE                          335
#define TX1IE                         336
#define RCIE                          337
#define RC1IE                         338
#define ADIE                          339
#define PIR1                          340
#define TMR1IF                        341
#define TMR2IF                        342
#define CCP1IF                        343
#define SSPIF                         344
#define TXIF                          345
#define TX1IF                         346
#define TBIF                          347
#define RCIF                          348
#define RC1IF                         349
#define ADIF                          350
#define IPR1                          351
#define TMR1IP                        352
#define TMR2IP                        353
#define CCP1IP                        354
#define SSPIP                         355
#define TBIP                          356
#define TX1IP                         357
#define TXIP                          358
#define RC1IP                         359
#define RCIP                          360
#define ADIP                          361
#define PIE2                          362
#define CCP2IE                        363
#define LVDIE                         364
#define EEIE                          365
#define OSFIE                         366
#define PIR2                          367
#define CCP2IF                        368
#define LVDIF                         369
#define EEIF                          370
#define OSFIF                         371
#define IPR2                          372
#define CCP2IP                        373
#define LVDIP                         374
#define EEIP                          375
#define OSFIP                         376
#define PIE3                          377
#define TMR5IE                        378
#define RXB0IE                        379
#define IC1IE                         380
#define RXBNIE                        381
#define RXB1IE                        382
#define IC2QEIE                       383
#define TXB0IE                        384
#define IC3DRIE                       385
#define TXB1IE                        386
#define TXB2IE                        387
#define TXBNIE                        388
#define PTIE                          389
#define PIR3                          390
#define TMR5IF                        391
#define RXBNIF                        392
#define IC1IF                         393
#define IC2QEIF                       394
#define IC3DRIF                       395
#define PTIF                          396
#define TXBNIF                        397
#define IPR3                          398
#define TMR5IP                        399
#define IC1IP                         400
#define RXBNIP                        401
#define IC2QEIP                       402
#define IC3DRIP                       403
#define TXBNIP                        404
#define PTIP                          405
#define EECON1                        406
#define RD                            407
#define WR                            408
#define WREN                          409
#define WRERR                         410
#define FREE                          411
#define CFGS                          412
#define EEFS                          413
#define EEPGD                         414
#define BAUDCON                       415
#define ABDEN                         416
#define W4E                           417
#define WUE                           418
#define BRG16                         419
#define TXCKP                         420
#define SCKP                          421
#define RXCKP                         422
#define RXDTP                         423
#define RCMT                          424
#define RCIDL                         425
#define ABDOVF                        426
#define RCSTA                         427
#define RCD8                          428
#define RX9D                          429
#define OERR                          430
#define FERR                          431
#define ADDEN                         432
#define ADEN                          433
#define CREN                          434
#define SRENA                         435
#define SREN                          436
#define RC9                           437
#define RC8_9                         438
#define RX9                           439
#define SPEN                          440
#define TXSTA                         441
#define TXD8                          442
#define TX9D1                         443
#define TX9D                          444
#define TRMT                          445
#define TRMT1                         446
#define BRGH1                         447
#define BRGH                          448
#define SENDB1                        449
#define SENDB                         450
#define SYNC                          451
#define SYNC1                         452
#define TXEN1                         453
#define TXEN                          454
#define TX91                          455
#define TX8_9                         456
#define TX9                           457
#define CSRC1                         458
#define CSRC                          459
#define QEICON                        460
#define PDEC                          461
#define PDEC0                         462
#define PDEC1                         463
#define QEIM                          464
#define QEIM0                         465
#define QEIM1                         466
#define QEIM2                         467
#define DOWN                          468
#define nDOWN                         469
#define UP_nDOWN                      470
#define NOT_DOWN                      471
#define UP                            472
#define UPDOWN                        473
#define UP_NOT_DOWN                   474
#define UP_DOWN                       475
#define ERROR                         476
#define VELM                          477
#define nVELM                         478
#define NOT_VELM                      479
#define T5CON                         480
#define TMR5ON                        481
#define TMR5CS                        482
#define RD165                         483
#define T5SYNC                        484
#define nT5SYNC                       485
#define NOT_T5SYNC                    486
#define SOSCEN5                       487
#define T5PS0                         488
#define T5PS                          489
#define T5PS1                         490
#define T5MOD                         491
#define nRESEN                        492
#define NOT_RESEN                     493
#define RESEN                         494
#define T5SEN                         495
#define ANSEL0                        496
#define ANS0                          497
#define ANS1                          498
#define ANS2                          499
#define ANS3                          500
#define ANS4                          501
#define CCP2CON                       502
#define CCP2M                         503
#define CCP2M0                        504
#define CCP2M1                        505
#define CCP2M2                        506
#define CCP2M3                        507
#define DC2B0                         508
#define CCP2Y                         509
#define DC2B                          510
#define DC2B1                         511
#define CCP2X                         512
#define CCP1CON                       513
#define CCP1M0                        514
#define CCP1M                         515
#define CCP1M1                        516
#define CCP1M2                        517
#define CCP1M3                        518
#define CCP1Y                         519
#define DC1B                          520
#define DC1B0                         521
