tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2331_tdd.h
#define CCP1X                         522
#define DC1B1                         523
#define ADCON2                        524
#define ADCS0                         525
#define ADCS                          526
#define ADCS1                         527
#define ADCS2                         528
#define ACQT0                         529
#define ACQT                          530
#define ACQT1                         531
#define ACQT2                         532
#define ACQT3                         533
#define ADFM                          534
#define ADCON1                        535
#define ADPNT                         536
#define ADPNT0                        537
#define ADPNT1                        538
#define FFOVFL                        539
#define BFOVFL                        540
#define CHSN3                         541
#define BFEMT                         542
#define FIFOEN                        543
#define VCFG01                        544
#define VCFG                          545
#define VCFG0                         546
#define VCFG1                         547
#define ADCON0                        548
#define ADON                          549
#define GODONE                        550
#define nDONE                         551
#define GO_nDONE                      552
#define NOT_DONE                      553
#define GO_DONE                       554
#define DONE                          555
#define GO                            556
#define GO_NOT_DONE                   557
#define ACMOD0                        558
#define ACMOD                         559
#define ACMOD1                        560
#define ACSCH                         561
#define ACONV                         562
#define SSPCON                        563
#define SSPM0                         564
#define SSPM                          565
#define SSPM1                         566
#define SSPM2                         567
#define SSPM3                         568
#define CKP                           569
#define SSPEN                         570
#define SSPOV                         571
#define WCOL                          572
#define SSPSTAT                       573
#define BF                            574
#define UA                            575
#define R_NOT_W                       576
#define READ_WRITE                    577
#define NOT_W                         578
#define nW                            579
#define RW                            580
#define nWRITE                        581
#define R                             582
#define NOT_WRITE                     583
#define R_nW                          584
#define R_W                           585
#define START                         586
#define S                             587
#define STOP                          588
#define P                             589
#define NOT_A                         590
#define nA                            591
#define D_A                           592
#define D_nA                          593
#define D                             594
#define DA                            595
#define DATA_ADDRESS                  596
#define D_NOT_A                       597
#define NOT_ADDRESS                   598
#define nADDRESS                      599
#define CKE                           600
#define SMP                           601
#define T2CON                         602
#define T2CKPS0                       603
#define T2CKPS                        604
#define T2CKPS1                       605
#define TMR2ON                        606
#define T2OUTPS0                      607
#define TOUTPS0                       608
#define TOUTPS                        609
#define T2OUTPS1                      610
#define TOUTPS1                       611
#define T2OUTPS2                      612
#define TOUTPS2                       613
#define T2OUTPS3                      614
#define TOUTPS3                       615
#define PR2                           616
#define WM0                           617
#define WM1                           618
#define WAIT0                         619
#define WAIT1                         620
#define EBDIS                         621
#define T1CON                         622
#define TMR1ON                        623
#define TMR1CS                        624
#define NOT_T1SYNC                    625
#define T1SYNC                        626
#define nT1SYNC                       627
#define T1INSYNC                      628
#define T1OSCEN                       629
#define SOSCEN                        630
#define T1CKPS0                       631
#define T1CKPS                        632
#define T1CKPS1                       633
#define T1RUN                         634
#define RD16                          635
#define T1RD16                        636
#define RCON                          637
#define BOR                           638
#define NOT_BOR                       639
#define nBOR                          640
#define POR                           641
#define nPOR                          642
#define NOT_POR                       643
#define nPD                           644
#define NOT_PD                        645
#define PD                            646
#define NOT_TO                        647
#define nTO                           648
#define TO                            649
#define nRI                           650
#define NOT_RI                        651
#define RI                            652
#define nIPEN                         653
#define IPEN                          654
#define NOT_IPEN                      655
#define WDTCON                        656
#define SWDTEN                        657
#define WDTW                          658
#define LVDCON                        659
#define LVDL0                         660
#define LVDL                          661
#define LVDL1                         662
#define LVDL2                         663
#define LVDL3                         664
#define LVDEN                         665
#define IRVST                         666
#define IVRST                         667
#define OSCCON                        668
#define SCS0                          669
#define SCS                           670
#define SCS1                          671
#define FLTS                          672
#define IOFS                          673
#define OSTS                          674
#define IRCF                          675
#define IRCF0                         676
#define IRCF1                         677
#define IRCF2                         678
#define IDLEN                         679
#define T0CON                         680
#define T0PS                          681
#define T0PS0                         682
#define T0PS1                         683
#define T0PS2                         684
#define PSA                           685
#define T0PS3                         686
#define T0SE                          687
#define T0CS                          688
#define T016BIT                       689
#define TMR0ON                        690
#define STATUS                        691
#define C                             692
#define CARRY                         693
#define DC                            694
#define ZERO                          695
#define Z                             696
#define OV                            697
#define OVERFLOW                      698
#define N                             699
#define NEGATIVE                      700
#define INTCON3                       701
#define INT1IF                        702
#define INT1F                         703
#define INT2IF                        704
#define INT2F                         705
#define INT1E                         706
#define INT1IE                        707
#define INT2IE                        708
#define INT2E                         709
#define INT1P                         710
#define INT1IP                        711
#define INT2IP                        712
#define INT2P                         713
#define INTCON2                       714
#define RBIP                          715
#define TMR0IP                        716
#define T0IP                          717
#define INTEDG2                       718
#define INTEDG1                       719
#define INTEDG0                       720
#define RBPU                          721
#define NOT_RBPU                      722
#define nRBPU                         723
#define INTCON                        724
#define RBIF                          725
#define INT0F                         726
#define INT0IF                        727
#define T0IF                          728
#define TMR0IF                        729
#define RBIE                          730
#define INT0E                         731
#define INT0IE                        732
#define T0IE                          733
#define TMR0IE                        734
#define PEIE                          735
#define PEIE_GIEL                     736
#define GIEL                          737
#define GIE_GIEH                      738
#define GIE                           739
#define GIEH                          740
#define STKPTR0                       741
#define STKPTR                        742
#define STKPTR1                       743
#define STKPTR2                       744
#define STKPTR3                       745
#define STKPTR4                       746
#define STKUNF                        747
#define STKOVF                        748
#define STKFUL                        749

#endif // _PIC18F2331_H_
